{
  "backend/main.mo": "Main backend actor that includes blob storage mixin and manages published PDFs with publish, retrieve, list, and search functionality using case-insensitive text matching.",
  "feature_evidence.json": "Feature evidence report documenting four PDF translator features including implementation, disclaimer display, navigation integration, and page component creation with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing routing, layout, tool pages (converters, splitter, merger, editor, translator), reusable components, and styling configuration.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light and dark themes with neutral grayscale palette and red accent colors for destructive actions.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the React application titled 'Create your own PDF'.",
  "frontend/src/App.tsx": "Main app component configuring TanStack Router with routes for home, PDF tools (convert, split, merge, unlock, edit), and the new PDF translator feature.",
  "frontend/src/components/EditorToolbar.tsx": "Toolbar component for PDF editor providing tool selection buttons (select, text, highlight, shapes, signature) with active state styling.",
  "frontend/src/components/FileUploader.tsx": "Reusable file upload component with drag-and-drop support, file type and size validation, simulated progress tracking, and error handling.",
  "frontend/src/components/ImageReorder.tsx": "Component displaying uploaded images in a grid with thumbnails, sequential numbering, remove buttons, and order indication for PDF generation.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header, logo, navigation menu (desktop and mobile), and footer. Renders child routes via Outlet and includes links to all PDF tool pages.",
  "frontend/src/components/PageSelector.tsx": "Component for selecting individual PDF pages or page ranges with visual grid display. Provides select all, clear, and range input controls for page selection management.",
  "frontend/src/components/PdfCanvas.tsx": "Canvas component for rendering and navigating PDF pages with tool interaction. Currently simulates PDF rendering with page navigation controls.",
  "frontend/src/components/PdfReorder.tsx": "Component displaying a list of PDF files with reordering capability and remove buttons. Shows file names, sizes, and merge order.",
  "frontend/src/components/ToolCard.tsx": "Reusable card component for displaying PDF tool options with icon, title, description, and link. Features hover effects and navigation to tool pages.",
  "frontend/src/hooks/useActor.ts": "React Query hook for managing backend actor instances with Internet Identity authentication. Handles actor creation, caching, and query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication using DFINITY AuthClient. Manages login state, identity persistence, and authentication lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for PDF operations including fetching PDF lists, searching, retrieving published PDFs, and publishing new PDFs via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space. Defines design tokens for colors, borders, and component styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/DocToPdfConverter.tsx": "Page component for converting DOCX, TXT, and RTF documents to PDF format with file upload, conversion simulation, and download functionality.",
  "frontend/src/pages/Home.tsx": "Landing page displaying a hero section and grid of nine PDF tool cards (convert, edit, merge, split, translate, etc.) with descriptions and navigation links.",
  "frontend/src/pages/ImageToPdfConverter.tsx": "Page component for combining multiple images into a single PDF with drag-and-drop reordering, removal, and conversion functionality.",
  "frontend/src/pages/PdfEditor.tsx": "PDF editing page with toolbar for selecting annotation tools (text, highlight, shapes, signature) and canvas for applying edits to uploaded PDFs.",
  "frontend/src/pages/PdfMerge.tsx": "Page component for merging multiple PDF files with upload, reordering, removal, and merge functionality to create a single combined document.",
  "frontend/src/pages/PdfSplitter.tsx": "Page component for splitting PDFs by selecting specific pages or ranges, with upload, page selection, and extraction functionality.",
  "frontend/src/pages/PdfToDocConverter.tsx": "React component for converting PDF files to editable document formats (TXT or DOCX) with file upload, format selection, and download functionality using placeholder conversion logic.",
  "frontend/src/pages/PdfToImageConverter.tsx": "React component for converting PDF pages to images with file upload, conversion trigger, and image gallery display with individual/batch download options using simulated conversion.",
  "frontend/src/pages/PdfTranslator.tsx": "React component for translating PDF documents between 12 languages with source/target language selection, progress tracking, and download functionality while preserving layout (with placeholder translation logic).",
  "frontend/src/pages/PdfUnlock.tsx": "React component for removing password protection from encrypted PDFs by accepting password input, validating it, and providing download of unlocked file using simulated unlock logic.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme including sidebar/chart colors, container settings, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking a red-themed PDF manipulation platform with 9 implemented features including converters, splitter, merger, unlock, and editing tools, noting need for translation icon asset."
}