{
  "backend/main.mo": "Main Motoko actor that includes blob storage mixin and manages published PDFs with metadata (title, author, visibility), providing publish, retrieve, list, and search functionality.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: AI-based translation service replacement and reliable PDF text extraction/translation with preserved formatting.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, pages, utilities, and configuration files for the PDF tools application.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark theme variables for the application's design tokens.",
  "frontend/index.html": "HTML entry point that loads the React application from main.tsx into a root div element.",
  "frontend/src/App.tsx": "Main React application component that configures TanStack Router with routes for all PDF tools including translator, editor, converter, splitter, merger, and unlocker pages.",
  "frontend/src/components/EditorToolbar.tsx": "Toolbar component for PDF editor providing tool selection buttons (select, text, highlight, shapes, signature) with active state styling.",
  "frontend/src/components/FileUploader.tsx": "Reusable file upload component with drag-and-drop support, file type and size validation, progress tracking, and error handling.",
  "frontend/src/components/ImageReorder.tsx": "Component displaying uploaded images in a grid with thumbnails, order indicators, and remove buttons for managing image sequence before PDF conversion.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header, responsive navigation menu for PDF tools, logo, and footer with Caffeine.ai attribution. Uses TanStack Router for navigation and includes mobile menu toggle.",
  "frontend/src/components/PageSelector.tsx": "Component for selecting individual PDF pages or page ranges with visual grid display, range input fields, and select all/clear functionality. Manages selected pages state and provides callbacks for selection changes.",
  "frontend/src/components/PdfCanvas.tsx": "Canvas component for rendering and navigating PDF pages with simulated PDF display. Supports page navigation and displays active editor tool, though actual PDF rendering is mocked.",
  "frontend/src/components/PdfReorder.tsx": "Component displaying a list of PDF files with order numbers, file info, and remove buttons. Used for managing PDF merge order with visual feedback.",
  "frontend/src/components/ToolCard.tsx": "Reusable card component for displaying PDF tool options with icon, title, description, and hover effects. Links to specific tool pages using TanStack Router.",
  "frontend/src/hooks/useActor.ts": "React Query hook for managing ICP backend actor instances based on Internet Identity authentication state. Automatically recreates actor when identity changes and invalidates dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle. Provides login, logout, and authentication status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for PDF operations including fetching PDF lists, searching published PDFs, and publishing new PDFs to the ICP backend. Integrates with useActor for authenticated requests.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes using OKLCH color space. Defines design tokens for UI components including sidebar, charts, and semantic colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/DocToPdfConverter.tsx": "Page component for converting DOCX, TXT, and RTF documents to PDF format with file upload, conversion simulation, and download functionality.",
  "frontend/src/pages/Home.tsx": "Landing page displaying a hero section and grid of nine PDF tool cards (convert, edit, merge, split, unlock, translate) with descriptions and navigation links.",
  "frontend/src/pages/ImageToPdfConverter.tsx": "Page component that converts multiple images to PDF using pdf-lib loaded from CDN, with image reordering, removal, and A4-scaled page generation functionality.",
  "frontend/src/pages/PdfEditor.tsx": "PDF editor page with toolbar for selecting annotation tools (text, highlight, shapes, signature) and canvas for editing uploaded PDFs with save/download capability.",
  "frontend/src/pages/PdfMerge.tsx": "Page component for merging multiple PDF files with upload, reorder, remove, and merge simulation functionality, displaying success state with download option.",
  "frontend/src/pages/PdfSplitter.tsx": "PDF splitting page that allows users to upload a PDF, select specific pages to extract, and download the split result with simulated processing.",
  "frontend/src/pages/PdfToDocConverter.tsx": "React component for converting PDF files to editable document formats (TXT or DOCX) with file upload, format selection, and download functionality using placeholder conversion logic.",
  "frontend/src/pages/PdfToImageConverter.tsx": "React component for converting PDF pages to images with file upload, conversion trigger, and gallery display with individual/batch download options using simulated conversion.",
  "frontend/src/pages/PdfTranslator.tsx": "React component for translating PDF documents between languages using LibreTranslate API, dynamically loading PDF.js and pdf-lib from CDN, extracting text, translating in chunks, and generating a new translated PDF.",
  "frontend/src/pages/PdfUnlock.tsx": "React component for removing password protection from encrypted PDFs with password input, validation, and download functionality using placeholder unlock logic.",
  "frontend/src/utils/aiTranslator.ts": "Utility module providing text translation via LibreTranslate API with automatic fallback across multiple instances, chunked translation for large texts, and progress tracking support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with container, border radius, shadows, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file tracking a PDF manipulation website with 9 implemented features (PDF conversion, splitting, merging, editing, translation) and a known issue with the image-to-PDF download functionality. Uses red-themed UI and requires AI-based translation service integration."
}