{
  "backend/main.mo": "Motoko actor that manages published PDFs with blob storage, providing functions to publish, retrieve, list, and search PDFs by title or author with case-insensitive substring matching.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: Tamil language support in PDF translator, and download functionality fixes for Image-to-PDF, PDF-to-Image, PDF Splitter, PDF Merge, and Document-to-PDF converters.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, layout, tool pages (converters, splitter, merger, editor, translator), reusable components, and styling configuration with red-themed design system.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light and dark modes with red-themed primary colors and comprehensive design tokens for UI components.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Create your own PDF', and script reference to main.tsx React application.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with routes for home, PDF-to-image, image-to-PDF, document converters, splitter, merger, unlock, editor, and translator tools wrapped in Layout component.",
  "frontend/src/components/EditorToolbar.tsx": "PDF editor toolbar component with five tool buttons (select, text, highlight, draw, signature) that highlights the active tool and triggers tool change callbacks.",
  "frontend/src/components/FileUploader.tsx": "Reusable file upload component with drag-and-drop support, file type and size validation, simulated upload progress tracking, and error handling with visual feedback.",
  "frontend/src/components/ImageReorder.tsx": "Component displaying uploaded images in a responsive grid with thumbnails, sequential numbering, remove buttons, and order indication for PDF generation.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header navigation, mobile menu toggle, and footer. Renders navigation links for all PDF tool pages and uses TanStack Router for routing.",
  "frontend/src/components/PageSelector.tsx": "Component for selecting individual PDF pages or page ranges with visual grid display. Provides select all, clear, and range selection functionality with page number inputs.",
  "frontend/src/components/PdfCanvas.tsx": "Canvas component that renders PDF pages using pdf.js library with page navigation controls. Displays current page number and active editor tool status.",
  "frontend/src/components/PdfReorder.tsx": "Component displaying a list of PDF files with order numbers and remove buttons. Shows file names, sizes, and allows reordering for merge operations.",
  "frontend/src/components/ToolCard.tsx": "Reusable card component for displaying PDF tool options with icon, title, description, and hover effects. Links to specific tool pages using TanStack Router.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the ICP backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication using DFINITY AuthClient. Manages login state, identity persistence, and provides login/logout functionality.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for PDF operations including fetching PDF lists, getting published PDFs, searching, and publishing with mutation support. All hooks depend on the authenticated actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming (light and dark modes), including colors for backgrounds, borders, charts, and sidebar components.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/pages/DocToPdfConverter.tsx": "Component for converting DOC/DOCX/TXT/RTF files to PDF using pdf-lib and mammoth libraries, with text extraction and PDF generation functionality.",
  "frontend/src/pages/Home.tsx": "Landing page displaying a hero section and grid of nine PDF tool cards (convert, edit, merge, split, translate, etc.) with navigation links.",
  "frontend/src/pages/ImageToPdfConverter.tsx": "Component for converting multiple images (PNG/JPG) to PDF with reordering support, using pdf-lib to embed images on A4 pages with aspect ratio preservation.",
  "frontend/src/pages/PdfEditor.tsx": "PDF editing interface with toolbar for selecting tools (text, highlight, draw, signature) and canvas for annotations, with save/download functionality.",
  "frontend/src/pages/PdfMerge.tsx": "Component for merging multiple PDF files into one document using pdf-lib, with file reordering and removal capabilities before merging.",
  "frontend/src/pages/PdfSplitter.tsx": "React component for splitting PDFs by selecting specific pages. Dynamically loads PDF.js and pdf-lib libraries, allows page selection, and generates a new PDF containing only the selected pages.",
  "frontend/src/pages/PdfToDocConverter.tsx": "React component for converting PDFs to text or DOCX format. Extracts text from PDF pages using PDF.js and creates either plain text files or formatted DOCX documents using the docx library.",
  "frontend/src/pages/PdfToImageConverter.tsx": "React component for converting PDF pages to PNG images. Renders each page to canvas using PDF.js, allows individual image downloads, and supports bulk download as a ZIP file using JSZip.",
  "frontend/src/pages/PdfTranslator.tsx": "React component for translating PDF documents between languages. Extracts text from PDFs, translates content using AI translation utility in chunks, and generates a new PDF with translated text while showing progress.",
  "frontend/src/pages/PdfUnlock.tsx": "React component for removing password protection from PDFs. Accepts password input, attempts to load encrypted PDFs with pdf-lib, and saves an unencrypted version for download.",
  "frontend/src/utils/aiTranslator.ts": "AI-powered translation utility using LibreTranslate API with automatic fallback across multiple instances, supporting chunked translation for large documents with progress callbacks and rate limiting.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with sidebar/chart colors, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document for a red-themed PDF manipulation website with multiple conversion tools (PDF to/from images, documents), editing features, and a known issue with broken download functionality across tools."
}